package final_project;

import java.util.Scanner;

public class Main {
	//C:\Users\student\Documents\Lns55\final_project\bin>java -cp . final_project.Main
	public static final String	BACKGROUND_BLACK	= "\u001B[40m";
	public static final String	BACKGROUND_GREEN	= "\u001B[42m";
	public static final String	GREEN				= "\u001B[32m";
	public static final String	BLACK				= "\u001B[30m";
	public static final String RESET = "\033[0m";
	
	public static final String	ITALIC				= "\u001B[3m";
	
	public static void opening1() throws InterruptedException { 
		String[][] opening = {  //58 ширина  9 высота  37 кадров
	    {
	    	GREEN+
			"                                                          ", 
			"                                                          ", 
			"                                                          ",
			"                                                          ",
			"                            ██                            ",
			"                                                          ",
			"                                                          ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                                                          ",
			"                           ████                           ",
			"                           █  █                           ",
			"                           ████                           ",
			"                                                          ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                            ██                            ",
			"                           █  █                           ",
			"                          █    █                          ",
			"                           █  █                           ",
			"                            ██                            ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                           ████                           ",
			"                          █    █                          ",
			"                         █      █                         ",
			"                          █    █                          ",
			"                           ████                           ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                           ████                           ", 
			"                          █    █                          ",
			"                         █      █                         ",
			"                        █        █                        ",
			"                         █      █                         ",
			"                          █    █                          ",
			"                           ████                           ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                           ████                           ", 
			"                          █    █                          ",
			"                         █      █                         ",
			"                        █        █                        ",
			"                         █      █                         ",
			"                          █    █                          ",
			"                           ████                           ",
			"                                                          ",	
		},
	    {
			"                           ████                           ", 
			"                          █    █                          ", 
			"                         █      █                         ",
			"                        █        █                        ",
			"                       █          █                       ",
			"                        █        █                        ",
			"                         █      █                         ",
			"                          █    █                          ",
			"                           ████                           ",	
		},
	    {
			"                          █    █                          ", 
			"                         █      █                         ", 
			"                        █        █                        ",
			"                       █          █                       ",
			"                      █            █                      ",
			"                       █          █                       ",
			"                        █        █                        ",
			"                         █      █                         ",
			"                          █    █                          ",	
		},
	    {
			"                         █      █                         ", 
			"                        █        █                        ", 
			"                       █          █                       ",
			"                      █            █                      ",
			"                     █              █                     ",
			"                      █            █                      ",
			"                       █          █                       ",
			"                        █        █                        ",
			"                         █      █                         ",	
		},
	    {
			"                        █        █                        ", 
			"                       █          █                       ", 
			"                      █            █                      ",
			"                     █              █                     ",
			"                    █                █                    ",
			"                     █              █                     ",
			"                      █            █                      ",
			"                       █          █                       ",
			"                        █        █                        ",	
		},
	    {
			"                       █          █                       ", 
			"                      █            █                      ", 
			"                     █              █                     ",
			"                    █                █                    ",
			"                   █                  █                   ",
			"                    █                █                    ",
			"                     █              █                     ",
			"                      █            █                      ",
			"                       █          █                       ",	
		},
	    {
			"                       █          █                       ", 
			"                      █            █                      ", 
			"                     █              █                     ",
			"                    █                █                    ",
			"                   █                  █                   ",
			"                    █                █                    ",
			"                     █              █                     ",
			"                      █            █                      ",
			"                       █          █                       ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                                                          ",
			"                                                          ",
			"                            ██                            ",
			"                                                          ",
			"                                                          ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                                                          ",
			"                           ████                           ",
			"                           █  █                           ",
			"                           ████                           ",
			"                                                          ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                                                          ", 
			"                           █  █                           ",
			"                              █                           ",
			"                              █                           ",
			"                                                          ",
			"                           █  ██                          ",
			"                                                          ",
			"                                                          ",	
		},
	    {
			"                                                          ", 
			"                          █ █ █                           ", 
			"                           █  █                           ",
			"                              █                           ",
			"                              █                           ",
			"                                                          ",
			"                           █  ██                          ",
			"                         █ █  █ █                         ",
			"                                                          ",	
		},
	    {
			"                        ██   ██                           ", 
			"                        █ █ █ █                           ", 
			"                        █  █  █                           ",
			"                        █     █                           ",
			"                        █     █  █                        ",
			"                                                          ",
			"                        █  █  ██                          ",
			"                         █ █  █ █                         ",
			"                          ██  █  █                        ",	
		},
	    {
			"                        ██   ██                           ", 
			"                        █ █ █ █                           ", 
			"                        █  █  █                           ",
			"                        █     █   █                       ",
			"                        █     █  █                        ",
			"                                                          ",
			"                       ██  █  ██  █                       ",
			"                       █ █ █  █ █ █                       ",
			"                       █  ██  █  ██                       ",	
		},
	    {
			"                        ██   ██                           ", 
			"                        █ █ █ █                           ", 
			"                        █  █  █    █                      ",
			"                        █     █   █                       ",
			"                        █     █  █                        ",
			"                                                          ",
			"                       ██  █  ██  █                       ",
			"                       █ █ █  █ █ █                       ",
			"                       █  ██  █  ██                       ",	
		},
	    {
			"                     █  ██   ██                           ", 
			"                        █ █ █ █     █                     ", 
			"                     █  █  █  █    █                      ",
			"                        █     █   █                       ",
			"                     █  █     █  █                        ",
			"                                                          ",
			"                       ██  █  ██  █                       ",
			"                       █ █ █  █ █ █                       ",
			"                       █  ██  █  ██                       ",	
		},
	    {
			"                    ██  ██   ██      █                    ", 
			"                        █ █ █ █     █                     ", 
			"                    ██  █  █  █    █                      ",
			"                        █     █   █                       ",
			"                    ██  █     █  █                        ",
			"                                                          ",
			"                       ██  █  ██  █  █                    ",
			"                       █ █ █  █ █ █  █                    ",
			"                    █  █  ██  █  ██  █                    ",	
		},
	    {
			"                   ███  ██   ██      █                    ", 
			"                        █ █ █ █     █ █                   ", 
			"                   ███  █  █  █    █                      ",
			"                        █     █   █                       ",
			"                   ███  █     █  █                        ",
			"                                                          ",
			"                       ██  █  ██  █  ██                   ",
			"                   █   █ █ █  █ █ █  █                    ",
			"                    █  █  ██  █  ██  ██                   ",	
		},
	    {
			"                  ████  ██   ██      █                    ", 
			"                  █     █ █ █ █     █ █                   ", 
			"                  ████  █  █  █    █   █                  ",
			"                  █     █     █   █                       ",
			"                  ████  █     █  █                        ",
			"                                                          ",
			"                  █    ██  █  ██  █  ███                  ",
			"                   █   █ █ █  █ █ █  █ █                  ",
			"                    █  █  ██  █  ██  ███                  ",	
		},
	    {
			"                  ████  ██   ██      █                    ", 
			"                  █     █ █ █ █     █ █                   ", 
			"                  ████  █  █  █    █   █                  ",
			"                  █     █     █   █     █                 ",
			"                  ████  █     █  █                        ",
			"                                                          ",
			"                  █    ██  █  ██  █  ███                  ",
			"                 █ █   █ █ █  █ █ █  █ █                  ",
			"                    █  █  ██  █  ██  ███                  ",	
		},
	    {
			"                  ████  ██   ██      █                    ", 
			"                  █     █ █ █ █     █ █                   ", 
			"                  ████  █  █  █    █   █                  ",
			"                  █     █     █   █     █                 ",
			"                  ████  █     █  █       █                ",
			"                                                          ",
			"                  █    ██  █  ██  █  ███                  ",
			"                 █ █   █ █ █  █ █ █  █ █                  ",
			"                █   █  █  ██  █  ██  ███                  ",	
		},
	    {
			"               █  ████  ██   ██      █    █               ", 
			"               █  █     █ █ █ █     █ █                   ", 
			"               █  ████  █  █  █    █   █                  ",
			"               █  █     █     █   █     █                 ",
			"               █  ████  █     █  █       █                ",
			"                                                          ",
			"                  █    ██  █  ██  █  ███  █               ",
			"                 █ █   █ █ █  █ █ █  █ █  █               ",
			"                █   █  █  ██  █  ██  ███  █               ",	
		},
	    {
			"               █  ████  ██   ██      █    ██              ", 
			"               █  █     █ █ █ █     █ █                   ", 
			"               █  ████  █  █  █    █   █                  ",
			"               █  █     █     █   █     █                 ",
			"              ██  ████  █     █  █       █                ",
			"                                                          ",
			"                  █    ██  █  ██  █  ███  ██              ",
			"                 █ █   █ █ █  █ █ █  █ █  █ █             ",
			"                █   █  █  ██  █  ██  ███  █               ",	
		},
	    {
			"               █  ████  ██   ██      █    ████            ", 
			"               █  █     █ █ █ █     █ █      █            ", 
			"               █  ████  █  █  █    █   █     █            ",
			"             █ █  █     █     █   █     █    █            ",
			"              ██  ████  █     █  █       █   █            ",
			"                                                          ",
			"             █    █    ██  █  ██  █  ███  ██              ",
			"                 █ █   █ █ █  █ █ █  █ █  █ █             ",
			"             █  █   █  █  ██  █  ██  ███  █  █            ",	
		},
	    {
			"               █  ████  ██   ██      █    ██████          ", 
			"               █  █     █ █ █ █     █ █      █            ", 
			"            █  █  ████  █  █  █    █   █     █            ",
			"             █ █  █     █     █   █     █    █            ",
			"              ██  ████  █     █  █       █   █            ",
			"                                                          ",
			"            ██    █    ██  █  ██  █  ███  ██  █           ",
			"                 █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"            ██  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"               █  ████  ██   ██      █    ███████         ", 
			"           █   █  █     █ █ █ █     █ █      █            ", 
			"            █  █  ████  █  █  █    █   █     █            ",
			"             █ █  █     █     █   █     █    █            ",
			"              ██  ████  █     █  █       █   █            ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"          █    █  ████  ██   ██      █    ███████         ", 
			"           █   █  █     █ █ █ █     █ █      █            ", 
			"            █  █  ████  █  █  █    █   █     █            ",
			"             █ █  █     █     █   █     █    █            ",
			"              ██  ████  █     █  █       █   █            ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"         ██    █  ████  ██   ██      █    ███████  █      ", 
			"         █ █   █  █     █ █ █ █     █ █      █            ", 
			"         █  █  █  ████  █  █  █    █   █     █     █      ",
			"         █   █ █  █     █     █   █     █    █     █      ",
			"         █    ██  ████  █     █  █       █   █     █      ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"      █  ██    █  ████  ██   ██      █    ███████  █  █   ", 
			"         █ █   █  █     █ █ █ █     █ █      █        █   ", 
			"      █  █  █  █  ████  █  █  █    █   █     █     █  █   ",
			"      █  █   █ █  █     █     █   █     █    █     █  █   ",
			"      █  █    ██  ████  █     █  █       █   █     █  █   ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"   █  █  ██    █  ████  ██   ██      █    ███████  █  ██  ", 
			"         █ █   █  █     █ █ █ █     █ █      █        █   ", 
			"      █  █  █  █  ████  █  █  █    █   █     █     █  █   ",
			"      █  █   █ █  █     █     █   █     █    █     █  █   ",
			"   █  █  █    ██  ████  █     █  █       █   █     █  ██  ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"   █  █  ██    █  ████  ██   ██      █    ███████  █  ███ ", 
			"  █      █ █   █  █     █ █ █ █     █ █      █        █   ", 
			"      █  █  █  █  ████  █  █  █    █   █     █     █  █   ",
			"  █   █  █   █ █  █     █     █   █     █    █     █  █   ",
			"   █  █  █    ██  ████  █     █  █       █   █     █  ███ ",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			"   █  █  ██    █  ████  ██   ██      █    ███████  █  ████", 
			"  █      █ █   █  █     █ █ █ █     █ █      █        █   ", 
			" █    █  █  █  █  ████  █  █  █    █   █     █     █  █   ",
			"  █   █  █   █ █  █     █     █   █     █    █     █  █   ",
			"   █  █  █    ██  ████  █     █  █       █   █     █  ████",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           ",	
		},
	    {
			BACKGROUND_GREEN+BLACK+
			"█  █  █  ██    █  ████  ██   ██      █    ███████  █  ████", 
			"█ █      █ █   █  █     █ █ █ █     █ █      █        █   ", 
			"██    █  █  █  █  ████  █  █  █    █   █     █     █  █   ",
			"█ █   █  █   █ █  █     █     █   █     █    █     █  █   ",
			"█  █  █  █    ██  ████  █     █  █       █   █     █  ████",
			"                                                          ",
			"           ███    █    ██  █  ██  █  ███  ██  █           ",
			"           █     █ █   █ █ █  █ █ █  █ █  █ █ █           ",
			"           ███  █   █  █  ██  █  ██  ███  █  ██           "+RESET,	
		}
		};
		
		for(int i = 0; i < 37;i++) {
			System.out.println("\n".repeat(100));
			for(int j = 0;j < 9; j++) {
				System.out.println(opening[i][j]);
			}
			
			Thread.sleep(100);
		}
		Thread.sleep(1000);
		System.out.println("\n".repeat(10));
		
		
		
		
	}

	public static void main(String[] args) throws InterruptedException {
		opening1();
		Scanner sc = new Scanner(System.in);
		double g = 10;
		double v0 = 45; // ????
		double L_max = (v0 * v0) / g;
		String game_go = "Y";
		while (game_go.equalsIgnoreCase("Y") ) {
			double S = (int) (Math.random() * (int) (L_max - 50)) + 50; // расстояние до цели ????
			double r = (int) (Math.random() * (int) (v0 / 2)) + 1; // размер цели ???
			System.out.println("_" + " 1 м ;" + "начальная скорость " + (v0));
			for (int i = 0; i < S + r; i++) { // отрисовка мишени
				if (i < S - r) {
					System.out.print(' ');
				} else {
					System.out.print('_');
				}
			}
			System.out.println();

			double a = (sc.nextDouble() * Math.PI) / 180;
			double y0 = 0;
			double v0x = v0 * Math.cos(a);
			double v0y = v0 * Math.sin(a);
			double x = 0;
			double y = 0;
			double t = 0; // временные значения скорости и времени
			double l = ((v0 * v0) * Math.sin(2 * a)) / g; // расстояние которое пролетит тело
			double h = (v0y * v0y) / (2 * g);
			double dt = 0.01;
			// создание массива
			char[][] path = new char[(int) ((h + 10) / 2)][(int) (l + 10)];

			do { // истинная отрисовка
				System.out.println("\n".repeat(100)); // очистка консоли
				t += dt;
				x = v0x * t; // зависимость x(t)
				y = y0 + v0y * t - (g * t * t) / 2; // зависимость y(t)
				path[(int) (y / 2)][(int) (x)] = '.';

				System.out.println("_" + " 1 м ;" + "начальная скорость " + (v0));
				for (int i = (int) (h / 2) ; i >= 0;i--) { // вывод массива
					for (int j = 0; j < (int) (l); j++) {
						System.out.print(path[i][j]);
					}
					System.out.println();
				}

				for (int i = 0; i < S + r; i++) { // отрисовка мишени
					if (i < S - r) {
						System.out.print(' ');
					} else {
						System.out.print('_');
					}
				}
				System.out.println();

				Thread.sleep(100); // пауза

			} while (x < l && y >= 0);

			// временное заполнение массива

//			  for(double t = 0;x < l && y >= 0;t += 0.01) { x = v0x*t; // зависимость x(t)
//			  y = y0 + v0y * t - (g*t*t)/2; // зависимость y(t) 
//			  path[(int)(y/2)][(int)(x)]= '.';
//			  
//			  
//			  
//			  
//			  }

			// System.out.println("L_max : "+(L_max));
			if (S + r > l && S - r < l) {
				System.out.println("Попал");
			} else {
				System.out.println("Не попал");
			}

			System.out.println("Для подолжения игры введите Y , для выхода что нибудь другое");
			game_go = sc.next();

		}

	}

}
